{"data":{"allMdx":{"nodes":[{"frontmatter":{"title":"Integrating PayTM API for Mobile","path":"/articles/sdks-&-apis/integrating-paytm-api","topic":"SDKs & APIs","time":"4 min read","intro":"One of the most amazing recent experiences I had with a popular third-party SDK was with the PayTM payment gateway Android SDK. The task was to integrate the SDK into a project to facilitate the acceptance of in-app payments through PayTM.","imgUrl":"https://source.unsplash.com/fJTqyZMOh18/800x800","articleNumber":1}},{"frontmatter":{"title":"GitHub Pages 101 Roadmap","path":"/articles/github-pages/roadmap","topic":"GitHub Pages","time":"2 min read","intro":"I’ve decided to create a detailed guide on GitHub Pages, a platform used by over 40 million developers to host their projects as well as static webpages. I see a lot of beginners struggling to configure the service correctly on their projects, and more often than not risk themselves towards alarming issues such as domain takeover, security key exposure etc.","imgUrl":"https://source.unsplash.com/VLaKsTkmVhk/800x800","articleNumber":2}},{"frontmatter":{"title":"What is GitHub Pages?","path":"/articles/github-pages/what-is-github-pages","topic":"GitHub Pages","time":"4 min read","intro":"GitHub Pages is a web hosting service offered by GitHub, which allows you to host your websites on a github.io subdomain. The coolest thing about this service is that it integrates directly with your codebase, ie. your code's repository, so deploying a site on GitHub Pages means simply pushing your files onto your GitHub Repository, and the GitHub Pages system then takes your bunch of files, optionally passes them through a build sequence and then deploys it to the github.io subdomain assigned to your repo.","imgUrl":"https://source.unsplash.com/XtUd5SiX464/800x800","articleNumber":3}},{"frontmatter":{"title":"Creating a GitHub Page Website","path":"/articles/github-pages/creating-a-website","topic":"GitHub Pages","time":"4 min read","intro":"A user-friendly guide to the world's largest free static web hosting. Configuring a website on GitHub Pages is one of the easiest things to do. I'm gonna chart the process out in simple words -","imgUrl":"https://source.unsplash.com/xpo5BggQo3E/800x800","articleNumber":4}}]}}}